In [18]:
import pandas as pd
import numpy as np
import random
import string
np.random.seed(56)

In [6]:
pd.DataFrame({'A':[1,2],'B':[3,4], 'C':[5,6]}, index = [1,2])

   A  B  C
1  1  3  5
2  2  4  6

In [8]:
pd.DataFrame([[1,2,3],[4,5,6]], index=[1,2], columns=['A','B','C'])

   A  B  C
1  1  2  3
2  4  5  6

In [14]:
pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[10,11,12]], index =range(1,5), columns=['A','B','C'])

    A   B   C
1   1   2   3
2   4   5   6
3   7   8   9
4  10  11  12

In [17]:
pd.Series({'한국':'서울', '일본':'도쿄', '중국':'베이징'})

한국     서울
일본     도쿄
중국    베이징
dtype: object

In [19]:
pd.DataFrame(np.random.randint(0,100, size=(2,3)))

    0   1   2
0  85  15  64
1  34  14  87

In [37]:
''.join(random.choice(string.ascii_letters) for i in range(5))

'exKcN'

In [38]:
def id():
    return ''.join(random.choice(string.ascii_letters) for i in range(5))

In [39]:
id()

'IRxap'

In [42]:
def score():
    return np.random.randint(0,100)

In [43]:
score()

14

In [79]:
pd.DataFrame([[score() for i in range(4)]for i in range(10)], index = [id() for i in range(10)], columns = ['국어', '수학', '영어', '사회'])

       국어  수학  영어  사회
kJleR  49  16  76  80
tnNAH  40  55   5   8
JDADI  66  21  70   0
GKcaT  62  94  39  70
rECcB  13  73  66  81
zcNpC  98  99  75  76
uYNEH  49  26  15  48
cUoMJ  73   5  76  68
zHwek  45  19  64  89
sSkYp  32  53   6  10

In [80]:
pd.DataFrame(np.random.randint(0, 100, size=(10, 4)),
             index=list((''.join(random.choice(string.ascii_letters) for i in range(5))) for i in range(10)),
             columns=['국어', '영어', '수학', '사회'])

       국어  영어  수학  사회
KGocV  79  61  43  43
fxqFK  75  55  97  90
IyOqr  16   0  63  23
lsLjs  83  83  72  57
iuusJ  39  84  59   4
XviWL  28  58  23  17
SotTW  99  82  56  17
jfnTF  75   3  53  78
BQXVT  32  36  93  47
UzYfh  83  41  10  93

In [81]:
df = pd.DataFrame({"국어":score(), "영어":score(), "수학":score(), "사회":score()}, index=[id()])
for i in range(1,10):
    df.loc[id()] = {"국어":score(), "영어":score(), "수학":score(), "사회":score()}
df

       국어  영어  수학  사회
QIHou  54  65  89  56
TUJLr  96  15  28  64
jSoWP  35  14  92  21
luEZL  66  70   7  54
cSLJH  84  11  10  77
LMfKz  63  48  10  54
fINNN  62  21  33  83
hkzDE  14  48  10   5
rxvXi  53  76  71  22
vijEL   3  39  80  45